notes/meeting_2023jan29.org
* meeting notes January 29, 2023
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023jan29.md
****** source file (for corrections, etc)
******* https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023jan29.org
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2023jan29
***** last meeting notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan15.md

** topics
*** richard hainsworth 
**** new doc site efforts
***** https://new-raku.finanalyst.org

**** uses css framework:
***** https://bulma.io/

**** code
***** https://github.com/raku/doc-website

**** rawleyfowler did dark theme feature
***** looks identical to "Dark Reader" firefox extension

*** weekly challenge
***** https://theweeklychallenge.org/blog/perl-weekly-challenge-201/
****** 1: Missing Numbers (integers?)
****** 2: Penny Piles

***** https://theweeklychallenge.org/blog/perl-weekly-challenge-200/
****** 1: Arithmetic Slices
****** 2: 

*** discussion of lazy infinite lists 
**** how can they work as well as they do?

** announcements 
*** next meeting: February 12th
