notes/meeting_2023jan29.md
- [meeting notes January 29, 2023](#orgff515ff)
  - [the raku study group](#org3e06069)
  - [topics](#orgd46b6b1)
    - [richard hainsworth](#org9d783d8)
    - [weekly challenge](#org5ec498d)
    - [discussion of lazy infinite lists](#org273ad7b)
  - [announcements](#org95aad42)
    - [next meeting: February 12th](#org3e5c775)


<a id="orgff515ff"></a>

# meeting notes January 29, 2023


<a id="org3e06069"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023jan29.md>
        
        2.  source file (for corrections, etc)
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023jan29.org>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2023jan29>
    
    3.  last meeting notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan15.md>


<a id="orgd46b6b1"></a>

## topics


<a id="org9d783d8"></a>

### richard hainsworth

1.  new doc site efforts

    1.  <https://new-raku.finanalyst.org>

2.  uses css framework:

    1.  <https://bulma.io/>

3.  code

    1.  <https://github.com/raku/doc-website>

4.  rawleyfowler did dark theme feature

    1.  looks identical to "Dark Reader" firefox extension


<a id="org5ec498d"></a>

### weekly challenge

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-201/>

    1.  1: Missing Numbers (integers?)
    
    2.  2: Penny Piles

2.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-200/>

    1.  1: Arithmetic Slices
    
    2.  2:


<a id="org273ad7b"></a>

### discussion of lazy infinite lists

1.  how can they work as well as they do?


<a id="org95aad42"></a>

## announcements


<a id="org3e5c775"></a>

### next meeting: February 12th
